sim/v9/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    blade
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    air
    {
        type            empty;
    }

    cyclic_1
    {
        type            cyclicAMI;
        neighbourPatch  cyclic_2;
        transform       rotational;
        rotationAxis    (0 0 1);
        rotationCentre  (0 0 0);
    }

    cyclic_2
    {
        type            cyclicAMI;
        neighbourPatch  cyclic_1;
        transform       rotational;
        rotationAxis    (0 0 1);
        rotationCentre  (0 0 0);
    }
}


// ************************************************************************* //
